In [1]:
# to install mysql connector
# !pip install mysql-connector

In [12]:
import mysql.connector #importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
  database = "pythonclass4pm"
)

db = database.cursor()

In [5]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(0, 'Hari', 67, 89, 95, 89, 72, 412, 80.0, 'A')
(1, 'Ram', 78, 80, 78, 89, 80, 400, 80.0, 'A')
(3, 'Hari', 67, 89, 95, 89, 72, 412, 80.0, 'B')

In [11]:
# Inserting data
sql = "INSERT INTO student(sn,name,physics,chemistry,math,engish,nepali,total,per,grade) VALUES(5,'Nabin',89,67,87,67,89,380,78,'B')"
db.execute(sql)
database.commit()

In [16]:
sn = int(input("Enter sn = "))
name = input("Enter name = ")
physics = int(input("Enter physics = "))
chemistry = int(input("Enter chemistry = "))
math = int(input("Enter math = "))
english = int(input("Enter english = "))
nepali = int(input("Enter nepali = "))

total = physics + chemistry +math+ english + nepali
per = total/5
if per >= 80:
    grade = "A"
    
elif per >= 60:
    grade = "B"

elif per >= 45:
    grade = "C"

else:
    grade = "F"

sql = f"INSERT INTO student(sn,name,physics,chemistry,math,engish,nepali,total,per,grade) VALUES({sn},'{name}',{physics},{chemistry},{math},{english},{nepali},{total},{per},'{grade}')"
db.execute(sql)
database.commit()

Enter sn = 6
Enter name = Ram
Enter physics = 89
Enter chemistry = 90
Enter math = 98
Enter english = 89
Enter nepali = 78

In [ ]:
# update
# UPDATE student SET name = 'Hari' , sn = 10 WHERE sn = 2

In [ ]:
# Delete
#DELETE FROM student WHERE sn = 2

In [ ]:
# sql = ?
# b.execute(sql)
# database.commit()

In [ ]:
UPDATE student SET name = '{name}' , sn = {sn} ,physics = {physics}, chemistry = 89, math = 89WHERE sn = 2

In [ ]:
sn = int(input("Enter sn = "))
name = input("Enter name = ")
physics = int(input("Enter physics = "))
chemistry = int(input("Enter chemistry = "))
math = int(input("Enter math = "))
english = int(input("Enter english = "))
nepali = int(input("Enter nepali = "))

total = physics + chemistry +math+ english + nepali
per = total/5
if per >= 80:
    grade = "A"
    
elif per >= 60:
    grade = "B"

elif per >= 45:
    grade = "C"

else:
    grade = "F"

sql = f"UPDATE student SET name = '{name}',physics= {physics}, chemistry = {chemistry}, math = {math},
engish={english}, nepali = {nepali}, total ={total}, per = {per}, grade = '{grade}' WHERE sn = {sn}"
db.execute(sql)
database.commit()

In [ ]:
# Delete
#DELETE FROM student WHERE sn = 2

In [18]:
db.execute("SELECT * FROM student")
result =db.fetchall()
result[:-4:-1]

[(6, 'Ram', 89, 90, 98, 89, 78, 444, 88.8, 'A'),
 (5, 'Nabin', 89, 67, 87, 67, 89, 380, 78.0, 'B'),
 (3, 'Hari', 67, 89, 95, 89, 72, 412, 80.0, 'B')]